tunr_app_api/app/controllers/songs_controller.rb

  def index
    @songs = Song.where(playlist_id: params[:playlist_id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = $1  [["playlist_id", 1]]

  def create
    @song = Song.new(song_params)
    @song.playlist_id = params[:playlist_id]

    if @song.save
---
INSERT INTO "songs" ("title", "artist", "duration", "created_at", "updated_at", "playlist_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Sweet Disposition"], ["artist", "Temper Trap"], ["duration", "3:54"], ["created_at", "2020-08-06 19:02:38.283734"], ["updated_at", "2020-08-06 19:02:38.283734"], ["playlist_id", 1]]

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 8]]